<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Course;

class CourseSeeder extends Seeder
{
    public function run(): void
    {
        $courses = [
            [
                'name' => 'مستوى 1: عربي',
                'description' => 'تعلم مبادئ اللغة العربية بطريقة مبسطة للمبتدئين، يشمل الحروف، القراءة والكتابة الأولية، مع اختبارات مميزه'],
            [
                'name' => 'مستوى 1: انجليزي',
                'description' => 'تعلم أساسيات اللغة الإنجليزية للمبتدئين، يشمل الحروف مع النطق، أيام الأسبوع، والأرقام بطريقة مبسطة وممتعة'],
            [
                'name' => 'مستوى 1: رياضيات',
                'description' => 'تعلم أساسيات الرياضيات للمبتدئين، يشمل الأعداد حتى 100 مع الجمع والطرح وخط الأعداد بطريقة سهلة وممتعة'],
            [
                'name' => 'مستوى 2: عربي',
                'description' => 'المستوى الثاني في تعلم اللغة العربية، يركز على تنمية المهارات وتوسيع المعرفة بالقواعد والمفردات بشكل مبسط'],
            [
                'name' => 'مستوى 2: انجليزي',
                'description' => 'المستوى الثاني في تعلم اللغة الإنجليزية، يركز على توسيع المفردات وتنمية المهارات للمبتدئين بطريقة ممتعة'],
            [
                'name' => 'مستوى 2: رياضيات',
                'description' => 'المستوى الثاني في الرياضيات للمبتدئين، يركز على تنمية المهارات الأساسية من الجمع والطرح غيرها بطريقة سهلة'],
            [
                'name' => 'مستوى 3: عربي',
                'description' => 'المستوى الثالث في اللغة العربية، يركز على تنمية القواعد وتوسيع المعرفة بتراكيب الجمل والأفعال بشكل مبسط'],
            [
                'name' => 'مستوى 3: انجليزي',
                'description' => 'المستوى الثالث في اللغة الإنجليزية، يركز على تحسين الكتابة وتطوير المفردات والقواعد بشكل مبسط وواضح'],
            [
                'name' => 'مستوى 3: رياضيات',
                'description' => 'المستوى الثالث في الرياضيات، يركز على تنمية التفكير الرياضي وتعزيز الفهم للمفاهيم الأساسية']           
        ];

        foreach ($courses as $course) {
            Course::create($course);
        }
    }
}