<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Lesson;

class LessonSeeder extends Seeder
{
    public function run(): void
    {
       $lessons = [
            // اللغة العربية (course_id=1)
            ['course_id' => 1, 'name' => 'المستوى الأول: الحروف الأبجدية وأصواتها'],
            ['course_id' => 1, 'name' => 'المستوى الثاني: حركات الضم والفتح والكسر'],
            ['course_id' => 1, 'name' => 'المستوى الثالث: تكوين جمل مفيدة'],
            ['course_id' => 1, 'name' => 'المستوى الرابع: قراءة وكتابة جمل عربية'],
            ['course_id' => 1, 'name' => 'المستوى الخامس: المفرد والمثنى والجمع'],
            ['course_id' => 1, 'name' => 'المستوى السادس: اللام الشمسية واللام القمرية'],
            ['course_id' => 1, 'name' => 'المستوى السابع: همزة الوصل والقطع'],
            ['course_id' => 1, 'name' => 'المستوى الثامن: أقسام الكلام'],
            ['course_id' => 1, 'name' => 'المستوى التاسع: حروف الجر'],
            ['course_id' => 1, 'name' => 'المستوى العاشر: التمييز بين الجملة والتركيب + الأفعال'],

             // اللغة الإنجليزية (course_id=3)
            ['course_id' => 2, 'name' => 'المستوى الأول: الحروف الأبجدية A-Z'],
            ['course_id' => 2, 'name' => 'المستوى الثاني: تعلم الأرقام والألوان'],
            ['course_id' => 2, 'name' => 'المستوى الثالث: أيام الأسبوع'],
            ['course_id' => 2, 'name' => 'المستوى الرابع: وسائل النقل'],
            ['course_id' => 2, 'name' => 'المستوى الخامس: الحيوانات والفواكه'],
            ['course_id' => 2, 'name' => 'المستوى السادس: أعضاء جسم الإنسان'],
            ['course_id' => 2, 'name' => 'المستوى السابع: تعلم المهن وأسمائها'],
            ['course_id' => 2, 'name' => 'المستوى الثامن: تعلم الأضداد (المفردات والعكس)'],
            ['course_id' => 2, 'name' => 'المستوى التاسع: تعلم كتابة حروف اللغة الإنجليزية كاملة'],
            ['course_id' => 2, 'name' => 'المستوى العاشر: أقسام الكلام'],

            // الرياضيات (course_id=2)
            ['course_id' => 3, 'name' => 'المستوى الأول: الأعداد من 1 إلى 10'],
            ['course_id' => 3, 'name' => 'المستوى الثاني: الجمع والطرح ضمن 10'],
            ['course_id' => 3, 'name' => 'المستوى الثالث: الأعداد من 1 إلى 100'],
            ['course_id' => 3, 'name' => 'المستوى الرابع: الجمع والطرح باستخدام خط الأعداد'],
            ['course_id' => 3, 'name' => 'المستوى الخامس: الجمع العمودي'],
            ['course_id' => 3, 'name' => 'المستوى السادس: جدول الضرب'],
            ['course_id' => 3, 'name' => 'المستوى السابع: القسمة البسيطة'],
            ['course_id' => 3, 'name' => 'المستوى الثامن: الكسور'],
            ['course_id' => 3, 'name' => 'المستوى التاسع: الأعداد العشرية'],
            ['course_id' => 3, 'name' => 'المستوى العاشر: المساحة والمحيط والأشكال الهندسية'],

           
        ];

        foreach ($lessons as $lesson) {
            Lesson::create($lesson);
        }
    }
}